adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78g14.c
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_io_init
* Description   : Sets ports to output mode.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_io_init(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch value setting to Low           */
            R_IIC_P_SDA0    = R_IIC_LOW;                        /* SDA0 output latch value setting to Low           */

            R_IIC_PM_SCL0   = R_IIC_OUT;                        /* SCL0 output mode                                 */
            R_IIC_PM_SDA0   = R_IIC_OUT;                        /* SDA0 output mode                                 */

            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch value setting to Low           */
            R_IIC_P_SDA0    = R_IIC_LOW;                        /* SDA0 output latch value setting to Low           */
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:                                                /* Channel 1                                        */
#ifdef IICA1_ENABLE
            R_IIC_P_SCL1    = R_IIC_LOW;                        /* SCL1 output latch value setting to Low           */
            R_IIC_P_SDA1    = R_IIC_LOW;                        /* SDA1 output latch value setting to Low           */

            R_IIC_PM_SCL1   = R_IIC_OUT;                        /* SCL1 output mode                                 */
            R_IIC_PM_SDA1   = R_IIC_OUT;                        /* SDA1 output mode                                 */

            R_IIC_P_SCL1    = R_IIC_LOW;                        /* SCL1 output latch value setting to Low           */
            R_IIC_P_SDA1    = R_IIC_LOW;                        /* SDA1 output latch value setting to Low           */
#endif /* #ifdef IICA1_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_io_chk_sda_setting
* Description   : Sets ports to input mode.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_io_chk_sda_setting(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            /* SCL input mode. */
            R_IIC_PM_SCL0   = R_IIC_IN;                         /* SCL0 input mode                                  */

            /* SDA input mode. */
            R_IIC_PM_SDA0   = R_IIC_IN;                         /* SDA0 input mode                                  */
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:                                                /* Channel 1                                        */
#ifdef IICA1_ENABLE
            /* SCL input mode. */
            R_IIC_PM_SCL1   = R_IIC_IN;                         /* SCL1 input mode                                  */
            /* SDA input mode. */

            R_IIC_PM_SDA1   = R_IIC_IN;                         /* SDA1 input mode                                  */
#endif /* #ifdef IICA1_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_clk_low
* Description   : Sets SCL to Low.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_clk_low(r_iic_drv_info_t *pRIic_Info)
{
    uint16_t    Cnt;
    
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch setting to Low                 */
            R_IIC_PM_SCL0   = R_IIC_OUT;                        /* SCL0 output mode                                 */
            R_IIC_P_SCL0    = R_IIC_LOW;                        /* SCL0 output latch setting to Low                 */
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:                                                /* Channel 1                                        */
#ifdef IICA1_ENABLE
            R_IIC_P_SCL1    = R_IIC_LOW;                        /* SCL1 output latch setting to Low                 */
            R_IIC_PM_SCL1   = R_IIC_OUT;                        /* SCL1 output mode.                                */
            R_IIC_P_SCL1    = R_IIC_LOW;                        /* SCL1 output latch setting to Low                 */
#endif /* #ifdef IICA1_ENABLE */
        break;
        
        default:
            /* Please add a channel as needed. */
        break;
    }
    
    /* Waits for setting SCL. */
    Cnt = SCL_L_WAIT;
    do
    {
        Cnt--;
    }
    while(0 != Cnt);

    
