adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78g14.c
}


/********************************************************************************************************************
* Function Name : r_iic_drv_clk_high
* Description   : Sets SCL to High.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_clk_high(r_iic_drv_info_t *pRIic_Info)
{
    uint16_t    Cnt;

    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            R_IIC_PM_SCL0   = R_IIC_IN;                         /* SCL0 input mode                                  */
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:                                                /* Channel 1                                        */
#ifdef IICA1_ENABLE
            R_IIC_PM_SCL1   = R_IIC_IN;                         /* SCL1 input mode                                  */
#endif /* #ifdef IICA1_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }

    /* Waits for setting SCL. */
    Cnt = SCL_H_WAIT;
    do
    {
        Cnt--;
    }
    while(0 != Cnt);

}


/********************************************************************************************************************
* Function Name : r_iic_drv_init_sfr
* Description   : IIC driver initialization
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_init_sfr(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcSVA       = SVA_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICF      = IICF_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICCTL1   = IICCTL1_ADR(pRIic_Info->ChNo);

    /* Ports open setting. */
    r_iic_drv_io_open(pRIic_Info);                              /* Port : Input, Output latch : Low                 */

    /* Initializes IICA register. */
    *pcIICCTL0 = R_IIC_IICCTL0_RESET;                           /* IICE = 0                                         */
    
    /* Sets a transfer clock. */
    r_iic_drv_set_frequency(pRIic_Info);

    /* Sets a local address. */
    *pcSVA = R_IIC_SVA;
    
    /* Sets IICCTL1. */
    *pcIICCTL1 |= R_IIC_IICCTL1_INIT;                           /* Sets SMC, DFC and PRS.                           */

    /* Sets a start condition. */
    *pcIICF |= R_IIC_IICF_INIT;                                 /* STCEN = 1, IICRSV = 1                            */

    /* Sets IICCTL0. */
    *pcIICCTL0 |= R_IIC_IICCTL0_INIT;                           /* SPIE = 1, WTIM = 1, ACKE = 1                     */

    /* Enables IIC. */
    *pcIICCTL0 |= R_IIC_IICCTL0_ENABLE;                         /* IICE = 1                                         */

}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_disable
* Description   : Disables interruption
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_disable(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            IICAMK0 = R_IIC_CH0_MK_DISABLE;                     /* Disables interruption.                           */
            IICAIF0 = R_IIC_CH0_IF_INIT;                        /* Clears interruption flag.                        */

            /* Sets interruption level. */
            IICAPR00 = R_IIC_CH0_PR0_INIT;
            IICAPR10 = R_IIC_CH0_PR1_INIT;
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:                                                /* Channel 1                                        */
#ifdef IICA1_ENABLE
            IICAMK1 = R_IIC_CH1_MK_DISABLE;                     /* Disables interruption.                           */
            IICAIF1 = R_IIC_CH1_IF_INIT;                        /* Clears interruption flag.                        */

            /* Sets interruption level. */
            IICAPR01 = R_IIC_CH1_PR0_INIT;
            IICAPR11 = R_IIC_CH1_PR1_INIT;
#endif /* #ifdef IICA1_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_enable
* Description   : Enables interruption
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_enable(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            IICAIF0 = R_IIC_CH0_IF_INIT;                        /* Clears interruption flag.                        */
            IICAMK0 = R_IIC_CH0_MK_ENABLE;                      /* Enables interruption.                            */
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:                                                /* Channel 1                                        */
#ifdef IICA1_ENABLE
            IICAIF1 = R_IIC_CH1_IF_INIT;                        /* Clears interruption flag.                        */
            IICAMK1 = R_IIC_CH1_MK_ENABLE;                      /* Enables interruption.                            */
#endif /* #ifdef IICA1_ENABLE */
        break;

        default:
        
