adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78g14.c
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_maskable_disable
* Description   : Sets interruption disabled.
* Arguments     : None
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_maskable_disable(void)
{
    /* Sets interruption disabled. */
#ifdef __CA78K0R__
    DI();
#endif  /* __CA78K0R__ */
#ifdef __CCRL__
    __DI();
#endif  /* __CCRL__ */
#ifdef __ICCRL78__
    __disable_interrupt();
#endif  /* __ICCRL78__ */
}


/********************************************************************************************************************
* Function Name : r_iic_drv_int_maskable_enable
* Description   : Sets interruption enabled.
* Arguments     : None
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_int_maskable_enable(void)
{
    /* Sets interruption enabled. */
#ifdef __CA78K0R__
    EI();
#endif  /* __CA78K0R__ */
#ifdef __CCRL__
    __EI();
#endif  /* __CCRL__ */
#ifdef __ICCRL78__
    __enable_interrupt();
#endif  /* __ICCRL78__ */
}


/********************************************************************************************************************
* Function Name : r_iic_drv_set_frequency
* Description   : Sets IIC Frequency.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_set_frequency(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICWL     = IICWL_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICWH     = IICWH_ADR(pRIic_Info->ChNo);

    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE
            *pcIICWL = R_IIC_CH0_LCLK;                          /* Low-level width setting                          */
            *pcIICWH = R_IIC_CH0_HCLK;                          /* High-level width setting                         */
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:
#ifdef IICA1_ENABLE                                             /* Channel 1                                        */
            *pcIICWL = R_IIC_CH1_LCLK;                          /* Low-level width setting                          */
            *pcIICWH = R_IIC_CH1_HCLK;                          /* High-level width setting                         */
#endif /* #ifdef IICA1_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}


/********************************************************************************************************************
* Function Name : r_iic_drv_check_sda_level
* Description   : Checks SDA level.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : R_IIC_TRUE                        ;   SDA = High
*               : R_IIC_FALSE                       ;   SDA = Low
*********************************************************************************************************************/
bool r_iic_drv_check_sda_level(r_iic_drv_info_t *pRIic_Info)
{
    bool        Ret = R_IIC_TRUE;
    uint16_t    Cnt;

    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:                                                /* Channel 0                                        */
#ifdef IICA0_ENABLE

            /* Checks SDA level. */
            Cnt = SDACHK_CNT;
            do
            {
                /* SDA = High? */
                if (R_IIC_HI == R_IIC_P_SDA0)
                {
                    break;                                      /* SDA = High                                       */
                }
                Cnt--;
            }
            while(Cnt != 0);

            /* Counter limit? */
            if(0 == Cnt)
            {
                Ret = R_IIC_FALSE;                              /* SDA = Low                                        */
            }
#endif /* #ifdef IICA0_ENABLE */
        break;

        case 1U:                                                /* Channel 1                                        */
#ifdef IICA1_ENABLE

            /* Checks SDA level. */
            Cnt = SDACHK_CNT;
            do
            {
                /* SDA = High? */
                if (R_IIC_HI == R_IIC_P_SDA1)
                {
                    break;                                      /* SDA = High                                       */
                }
                Cnt--;
            }
            while(Cnt != 0);

            /* Counter limit? */
            if(0 == Cnt)
            {
                Ret = R_IIC_FALSE;                              /* SDA = Low                                        */
            }
#endif /* #ifdef IICA1_ENABLE */
        break;

        default:
        
            /* Please add a channel as needed. */

        break;
    }

    return Ret;
}


/********************************************************************************************************************
* Outline       : Check SCL Level Processing
* Function Name : r_iic_drv_check_scl_level
* Description   : Checks SCL level from high to low.
* Arguments     : r_iic_drv_info_t * pRIic_Info     ;   IIC Information
* Return Value  : R_IIC_TRUE                        ;   SDA = High
*               : R_IIC_FALSE                       ;   SDA = Low
*********************************************************************************************************************/
bool r_iic_drv_check_scl_level(r_iic_drv_info_t * pRIic_Info)
{
    uint16_t cnt = 0;
    
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL1   = IICCTL1_ADR(pRIic_Info->ChNo);
    
